CSI API ETABS v1
cStory.SetGUID Method
 Sets the GUID of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGUID(
	string Name,
	string GUID = ""
)
Function SetGUID (
	Name As String,
	Optional GUID As String = ""
) As Integer
Dim instance As cStory
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetGUID(Name, GUID)
int SetGUID(
	String^ Name,
	String^ GUID = L""
)
abstract SetGUID :
        Name : string *
        ?GUID : string
(* Defaults:
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name if a defined story
GUID (Optional)
Type: System.String
 The GUID of the story
Return Value
Type: Int32
 Returns zero if the value is successfully set, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim iGUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set story GUID
       Dim g As String = Guid.NewGuid.ToString
       ret = SapModel.Story.SetGUID("Story2", g)
   'get story GUID
       ret = SapModel.Story.GetGUID("Story2", iGUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace